Repository: mabdullahm/ninja-forms
Catalog: lang/ninja-forms-*.po
Languages: ar

source: Fields marked with a * are required
ar: الحقول المعلمة بنجمة* مطلوبة

source: This is a required field
ar: هذا الحقل مطلوب

source: Please answer the anti-spam question correctly.
ar: الرجاء إدخال إجابة صحيحة على سؤال التحقق

source: Processing
ar: جاري المعالجة

source: Login
ar: تسجيل الدخول

source: Username
ar: اسم المستخدم

source: Reset Password (Opens in a new window)
ar: استعادة كلمة المرور(نافذة جديدة)

source: Password
ar: كلمة المرور

source: Re-enter Password
ar: أعد ادخال كلمة المرور

source: Passwords do not match.
ar: كلمات المرور غير متطابقة

source: Cancel
ar: إلغاء

source: Login failed, please try again.
ar: فشل تسجيل الدخول، الرجاء إعادة المحاولة مرةً أخرى

source: Register
ar: التسجيل

source: Email Address
ar: البريد الإلكتروني

source: There was an error registering you for this site.
ar: حدث خطأ أثناء التسجيل

source: Ninja Forms Password
ar: كلمة مرور Ninja Forms

source: You are receiving this email because you have an incomplete form. Your username is now your email address and your password has been reset. It is now
ar: المربع الجانبي لاستمارات Ninja Forms

source: Display Title
ar: العنوان

source: None
ar: بدون

source: Save Form Settings
ar: حفظ الإعدادات

source: Select All
ar: اختيار الكل

source: Append A Ninja Form
ar: تضمين استمارة مراسلة من Ninja Forms

source: Edit Menu Item
ar: تعديل عنصر القائمة

source: View Submissions
ar: عرض الرسائل

source: Remove
ar: إزالة

source: Required
ar: مطلوب

source: Save Field Settings
ar: حفظ إعدادات الحقل

source: Field Settings Saved
ar: تم حفظ إعدادات الحقل

source: a - Represents an alpha character (A-Z,a-z) - Only allows letters to be entered
ar: a - تمثل حرف أبجدي (A-Z,a-z) - تسمح فقط بإدخال أرقام أبجدية

source: 9 - Represents a numeric character (0-9) - Only allows numbers to be entered
ar: 9 - تمثل قيمة عددية (0-9) - تسمح فقط بإدخال أرقام

source: * - Represents an alphanumeric character (A-Z,a-z,0-9) - This allows both numbers and letters to be entered
ar: * - تمثل قيم عددية و حروف أبجدية معاً (A-Z,a-z,0-9) - هذا يسمح بإدخال أي قيمة، سواء حرف أو رقم

source: This would prevent the user from putting in anything other than numbers
ar: هذا سيمنع المستخدم من إدخال أي قيم أخرى غير الأرقام

source: Add New Form
ar: انشاء استمارة جديدة

source: Delete
ar: مسح

source: Export Forms
ar: تصدير الاستمارات

source: Forms Per Page
ar: عرض الاستمارات في الصفحة الواحدة

source: Form
ar: استمارة

source: Forms
ar: استمارات

source: Form Title
ar: عنوان الاستمارة

source: Date Updated
ar: تاريخ التحديث

source: Forms Deleted
ar: تم مسح الاستمارات

source: Form Deleted
ar: تم مسح الاستمارة

source: Basic Settings
ar: الإعدادات الأساسية

source: Display Form Title
ar: عرض عنوان الاستمارة

source: Save form submissions?
ar: حفظ الرسائل المرسلة عبر هذه الاستمارة؟

source: Require Logged-in?
ar: تتطلب تسجيل الدخول؟

source: Append to a page
ar: تضمين في صفحة

source: Submit via ajax?
ar: إرسال الرسائل عبر ajax؟

source: Success Page
ar: صفحة نجاح عملية الإرسال

source: Clear successfully completed form?
ar: مسح الاستمارات المكتملة؟

source: If this box is checked, Ninja Forms will clear the form after it has been successfully submitted.
ar: هذا الخيار سيجعل Ninja Forms تقوم بمسح الرسائل المرسلة بنجاح، تلقائياً

source: Hide successfully completed form?
ar: اخفاء الاستمارات المكتملة؟

source: If this box is checked, Ninja Forms will hide the form after it has been successfully submitted.
ar: هذا الخيار سيجعل Ninja Forms تقوم باخفاء الاستمارات المكتملة بنجاح، تلقائياً

source: Success Message
ar: رسالة نجاح العملية

source: If you want to include field data entered by the user, for instance a name, you can use the following shortcode: [ninja_forms_field id=23] where 23 is the ID of the field you want to insert. This will tell Ninja Forms to replace the bracketed text with whatever input the user placed in that field. You can find the field ID when you expand the field for editing.
ar: إذا كنت ترغب في تضمين البيانات التي يتم إدخالها من قبل المستخدم في حقل ما، على سبيل المثال حقل الاسم، يمكنك استخدام الكود المختصر: [ninja_forms_field id=23] مع استبدال الرقم 23 بمعرف الحقل الذي تود تضمينه. هذا يخبر Ninja Forms باستبدال النص بين الأقواس بأي بيانات يقوم المستخدم بإدخالها في ذلك الحقل. يمكنك العثور على معرف الحقل المطلوب بالذهاب إلى صفحة تعديل الحقل.

source: Email Settings
ar: إعدادات البريد الإلكتروني

source: Email From Address
ar: عنوان البريد الإلكتروني المرسل منه

source: Email Type
ar: نوع البريد الإلكتروني

source: User Email
ar: بريد المستخدم

source: Subject for the user email
ar: عنوان الموضوع لبريد المستخدم

source: Email message sent to the user
ar: الرسالة المرسلة للمستخدم

source: Include a list of fields?
ar: تضمين قائمة الحقول؟

source: Administrator Email
ar: بريد المدير

source: Administrator Email Addresses
ar: عنوان الإلكتروني للمدير

source: Admin Subject
ar: موضوع المدير

source: Admin Email Message
ar: رسالة بريد المدير

source: Please enter all the addresses this form should be sent to.
ar: الرجاء إدخال جميع عنواين البريد الإكتروني التي ترغب في إرسال البيانات المرسلة عبر هذه الاستمارة إليها

source: Form Settings Saved
ar: تم حفظ إعدادات الاستمارة

source: Backup / Restore
ar: نسخ احتياطي / استعادة

source: Backup Ninja Forms
ar: انشاء نسخة احتياطية لـ Ninja Forms

source: Restore Ninja Forms
ar: استعادة النسخة الاحتياطية لـ Ninja Forms

source: Import Favorite Fields
ar: استيراد الحقول المفضلة

source: Select a file
ar: ارفع ملف

source: Import Favorites
ar: استيراد المفضلة

source: No Favorite Fields Found
ar: لم يتم العثور على حقول مفضلة

source: Export Favorite Fields
ar: تصدير الحقول المفضلة

source: Export Fields
ar: تصدير الحقول

source: Please select favorite fields to export.
ar: الرجاء اختيار الحقول المفضلة لتصديرها

source: Favorites imported successfully.
ar: تم استيراد المفضلة بنجاح

source: Please select a valid favorite fields file.
ar: الرجاء اختيار ملف "حقول مفضلة" صالح

source: Import a form
ar: استيراد استمارة

source: Import Form
ar: استيراد استمارة

source: Export a form
ar: تصدير استمارة

source: Select a form
ar: اختيار استمارة

source: Export Form
ar: تصدير الاستمارة

source: Please select a form.
ar: الرجاء اختيار استمارة.

source: Form Imported Successfully.
ar: تم استيراد الاستمارة بنجاح

source: Please select a valid exported form file.
ar: الرجاء اختيار ملف صالح لاستمارة تم تصديرها سابقاً.

source: Import / Export Submissions
ar: استيراد / تصدير البيانات المرسلة

source: Date Settings
ar: إعدادات البيانات

source: Ajax Message Settings
ar: إعدادات رسالة Ajax

source: Ajax Message Format
ar: صيغة رسالة Ajax

source: Ninja Forms Test
ar: اختبار Ninja Forms

source: Ajax Loading Gif
ar: صورة تحميل Ajax (Gif(

source: Default
ar: الافتراضي

source: Custom
ar: مخصص

source: Settings Saved
ar: تم حفظ الإعدادات

source: Favorite Field Settings
ar: إعدادات الحقل المفضل

source: General Settings
ar: إعدادات عامة

source: Version
ar: الإصدار

source: Date Format
ar: صيغة البيانات

source: e.g. m/d/Y, d/m/Y - Tries to follow the <a href="http://www.php.net/manual/en/function.date.php" target="_blank">PHP date() function</a> specifications, but not every format is supported.
ar: مثال: m/d/Y, d/m/Y - تتبع مواصفات دالة <a href="http://www.php.net/manual/en/function.date.php" target="_blank">PHP date() </a>, و لكن ليست كل الصيغ مدعومة.

source: Currency Symbol
ar: رمز العملة

source: e.g. $, &pound;, &euro;
ar: مثال: $, &pound;, &euro;

source: Message Labels
ar: علامات الرسالة

source: Required Field Label
ar: علامة الحقل المطلوب

source: Required field symbol
ar: رمز الحقل المطلوب

source: Error message given if all required fields are not completed
ar: رسالة الخطأ عند عدم إكتمال الحقول المطلوبة

source: Required Field Error
ar: خطأ الحقل المطلوب

source: Anti-spam error message
ar: رسالة خطأ عملية التحقق

source: Please enter a valid email address
ar: الرجاء إدخال بريد إلمتروني صالح

source: If your form is submitted via ajax, what message should appear to let users know it is being processed?
ar: عند اختيار Ajax لإرسال الرسائل، ما هي الرسالة التي يجب أن تظهر للدلالة على أن عملية إرسال الرسائل جارية؟

source: Licenses
ar: التراخيص

source: Licenses Saved
ar: تم حفظ التراخيص

source: View Form Submissions
ar: عرض البيانات المرسلة عبر الاستمارة

source: Export
ar: تصدير

source: Submissions Per Page
ar: عدد البيانات المرسلة المعروض في الصفحة الواحدة

source: Download All Submissions
ar: تحميل كل البيانات المرسلة

source: Submission
ar: مرسل

source: Date
ar: التاريخ

source: Edit
ar: تعديل

source: Export to CSV
ar: تصدير بصيغة CSV

source: No submissions found
ar: لم يتم العثور على بيانات مرسلة

source: Back
ar: عودة

source: Apply
ar: تطبيق

source: Submissions Deleted
ar: تم مسح البيانات المرسلىة

source: Submission Deleted
ar: تم مسح البيانات المرسلىة

source: Select A Form
ar: اختيار استمارة

source: Date Range
ar: نطاق التلريخ

source: Optional
ar: اختياري

source: Begin Date
ar: تلريخ االبدء

source: End Date
ar: تاريخ الانتهاء

source: If both Begin Date and End Date are left blank, all submissions will be displayed.
ar: عند عدم اختيار نطاق تاريخ محدد، سيتم عرض كافة البيانات المرسلة.

source: Strength indicator
ar: مؤشر القوة

source: Very weak
ar: ضعيف جداً

source: Weak
ar: ضعيف

source: Strong
ar: قوي

source: Mismatch
ar: عدم تطابق

source: Fields marked with a * are required.
ar: الحقول المعلمة بنجمة* مطلوبة

source: User Submitted Values:
ar: بيانات المستخدم المرسلة:

source: Thank you for filling out this form.
ar: شكراً لملئك هذه الاستمارة

source: Please check required fields.
ar: الرجاء التحقق من االحقول المطلوبة

source: Default Value
ar: القيم الافتراضية

source: Text Element
ar: عنصر نص

source: User ID (If logged in)
ar: معرف المستخدم (في حالة تسجيل الدخول)

source: User Firstname (If logged in)
ar: اسم المستخدم الأول (في حالة تسجيل الدخول)

source: User Lastname (If logged in)
ar: اسم المستخدم الأخير (في حالة تسجيل الدخول)

source: User Display Name (If logged in)
ar: اسم العرض للمستخدم (في حالة تسجيل الدخول)

source: User Email (If logged in)
ar: بريد للمستخدم (في حالة تسجيل الدخول)

source: Custom Default Value
ar: قيمة افتراضية مخصصة

source: Is this an email address?
ar: هل هذا عنوان بريد إلكتروني؟

source: If this box is checked, Ninja Forms will validate this input as an email address.
ar: هذا الخيار سيجعل Ninja Forms تقوم بالتحقق من هذا الإدخال على أنه عنوان بريد إلكتروني.

source: Send a copy of the form to this address?
ar: إرسال نسخة من هذه الاستمارة إلى هذا العنوان؟

source: If this box is checked, Ninja Forms will send a copy of this form (and any messages attached) to this address.
ar: هذا الخيار سيجعل Ninja Forms تقوم بإرسال نسخة من هذه الاستمارة (و أي رسائل مرفقة) إلى هذا العنوان.

source: Multi-Select Box Size
ar: مقاس صندوق الاختيار المتعدد

source: Expand / Collapse Options
ar: توسيع / تقليص الخيارات

source: Options
ar: الخيارات

source: Add New
ar: إضافة جديد

source: Import Options
ar: استيراد الخيارات

source: Show option values
ar: اظهار قيم الخيار

source: Import
ar: استيراد

source: To use this feature, you can paste your CSV into the textarea above.
ar: لاستخدام هذه الخاصية، يمكنك لصق ملف CSV في منطقة النص أعلاه.

source: The format should look like the following:
ar: الصيغة يجب أن تكون مماثلة للآتي:

source: If you want to send an empty value, you can use '' for the value.
ar: إذا أردت إرسال قيمة فارغة، يمكنك استخدام " للقيمة

source: Use this as a registration password field
ar: استخدم هذا كحقل كلمة مرور

source: Re-enter Password Label
ar: علامة اعادة إدخال كلمة المرور

source: Show Password Strength Indicator
ar: إظهار مؤشر قوة كلمة المرور

source: Hint: The password should be at least seven characters long. To make it stronger, use upper and lower case letters, numbers and symbols like ! " ? $ % ^ &amp; ).
ar: ملاحظة: كلمة المرور يجب أن لا تقل عن 7 أحرف. لجعلها أقوى، استخدم تركيبة من الأرقام و الأحرف و الرموز كـ ! " ? $ % ^ &amp; ).

source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Number of stars
ar: عدد النجوم

source: Spam Question
ar: سؤال التحقق

source: Spam Answer
ar: إجابة سؤال التحقق

source: Show Rich Text Editor?
ar: إظهار محرر النصوص المتقدم؟

source: Input Mask
ar: قناع الإدخال

source: Phone - (555) 555-5555
ar: الهاتف - (555) 555-5555

source: Currency
ar: العملة

source: Custom Mask Definition
ar: تعريف قناع الإدخال المخصص

source: Please enter a valid email address.
ar: الرجاء إدخال عنوان بريد إلكتروني صالح

source: Calculation Settings
ar: خيارات عملية الحساب

source: <strong>Checked</strong> Calculation Value
ar: <strong>تم اختيار</strong> قيمة عملية الحساب

source: This is the value that will be used if <strong>Checked</strong>.
ar: هذه هي القيمة التي سيتم استخدامها إذا<strong>تم الاختيار</strong>.

source: <strong>Unchecked</strong> Calculation Value
ar: <strong>غير مختارة</strong> قيمة عملية الحساب

source: This is the value that will be used if <strong>Unchecked</strong>.
ar: هذه هي القيمة التي سيتم استخدامها إذا<strong>لم يتم الاختيار</strong>.

source: Include in payment details list?
ar: تضمين في قائمة تفاصيل الدفع؟

source: name
ar: الاسم

source: Show Help Text
ar: اظهار نص المساعدة

source: Help Text
ar: نص المساعدة

source: Left of Element
ar: يسار العنصر

source: Above Element
ar: أعلى العنصر

source: Below Element
ar: أدنى العنصر

source: Right of Element
ar: يمين العنصر

source: Inside Element
ar: داخل العنصر

source: Label Position
ar: موضع العلامة

source: label
ar: العلامة

source: help
ar: مساعدة

# password strength
source: Medium
ar: متوسط

source: Number of decimal places.
ar: عدد الخانات العشرية.

source: Calculation name
ar: اسم عملية الحساب

source: This is the programmatic name of your field. Examples are: my_calc, price_total, user-total.
ar: هذا هو الاسم البرمجي لحقلك. أمثلة: my_calc, price_total, user-total.

source: Display Options
ar: خيارات العرض

source: - None
ar: - بدون

source: Textbox
ar: مربع نصي

source: Label
ar: العلامة

source: Disable input?
ar: تعطيل الإدخال

source: Use the following shortcode to insert the final calculation: [ninja_forms_calc]
ar: استخدم الكود المختصر الآتي لإدخال ناتج عملية الحساب النهائي: [ninja_forms_calc]

source: You can enter calculation equations here using field_x where x is the ID of the field you want to use. For example, <strong>field_53 + field_28 + field_65</strong>.
ar: يمكنك استخدام معادلات الحساب باستخدام field_x حيث x معرف الحقل الذي تود استخدامه. مثال, <strong>field_53 + field_28 + field_65</strong>.

source: Specify Operations And Fields (Advanced)
ar: تحديد العمليات و الحقول (متقدم)

source: Use An Equation (Advanced)
ar: استخدام معادلة (متقدم)

source: Calculation Method
ar: طريقة الحساب

source: Field Operations
ar: عمليات الحقل

source: Add Operation
ar: إضافة عملية

source: Advanced Equation
ar: معادلة متقدمة

source: - Select a Field
ar: - اختيار حقل

source: Default Country
ar: البلد الافتراضي

source: Value
ar: القيمة

source: Selected
ar: اختير

source: Should be entered as a percentage. e.g. 8.25%, 4%
ar: يجب إدخالها كنسبة مئوية، كمثال: 8.25%, 4%

source: Disable Rich Text Editor on Mobile
ar: تعطيل المجرر المتقدم على الجوال

source: Form Settings
ar: إعدادات الاستمارة

source: Enter form title here
ar: أدخل عنوان الاستمارة هنا

source: Ninja Forms is a webform builder with unparalleled ease of use and features.
ar: Ninja Forms هي عبارة عن إضافة لانشاء الاستمارات، بمزايا كثيرة و سهلة الاستخدام.

source: Field Settings
ar: إعدادات الحقل

source: All Forms
ar: جميع الاستمارات

source: Go to the first page
ar: الذهاب إلى الصفحة الأولى

source: Go to the previous page
ar: الذهاب إلى الصفحة السابقة

source: Go to the next page
ar: الذهاب إلى الصفحة التالية

source: Go to the last page
ar: الذهاب إلى الصفحة الأخيرة

source: Delete this form
ar: مسح هذه الاستمارة

source: Form Preview
ar: معاينة الاستمارة

source: Plain Text
ar: نص

source: Extend Ninja Forms
ar: توسيع Ninja Forms

source: Layout and Styles
ar: التخطيط و التنسيق

source: This extension gives you power over the look and feel of your Ninja Forms from within your WordPress admin. It gives you the ability to style almost every part of your form, down to the the smallest detail, with little to no …
ar: حفظ التقدم

source: File Uploads
ar: مرفوعات الملفات

source: Front-End Posting
ar: التعديل المباشر

source: Multi-Part Forms
ar: الاستمارات متعدد الأجزاء

source: Extension Documentation
ar: وثائق المساعدة للإضافات

source: Documentation coming soon.
ar: وثائق المساعدة ستصدر قريباً

source: Active
ar: مفعل

source: Installed
ar: مثبت

source: Learn More
ar: تعلم المزيد

source: Data restored successfully!
ar: تم استعادة البيانات بنجاح

source: Favorite Fields
ar: الحقول المفضلة

source: Ajax Settings
ar: إعدادات Ajax

source: Inline Messages (Default)
ar: الرسائل المضمنة (الافتراضي)

source: Custom Message Display (Advanced)
ar: عرض رسالة مخصصة (متقدم)

source: General
ar: عام

source: Labels
ar: العلامات

source: Find Submissions
ar: العثور على البيانات المرسلة

source: Import/Export
ar: استيراد/تصدير

source: Import / Export
ar: استيراد / تصدير

source: Ninja Form Settings
ar: إعدادات إضافة Ninja Forms

source: Plugin Settings
ar: إعدادات الإضافة

source: Ninja Form Extensions
ar: إضافات Ninja Forms

source: Extend
ar: توسيع

source: Go
ar: ذهاب

source: Current page
ar: الصفحة الحالية

source: Back To Sub List
ar: الرجوع إلى القائمة الفرعية

source: Save
ar: حفظ

source: Preview Form
ar: معاينة الاستمارة

source: All
ar: الكل
